{"config": [{"config": {"function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-477806bbd6c7>\u00da\b<lambda>\u0007\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_1", "trainable": true, "cropping": [[70, 25], [0, 0]], "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"W_regularizer": null, "nb_row": 5, "nb_filter": 24, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "border_mode": "same", "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "nb_row": 5, "nb_filter": 36, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "border_mode": "same", "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "nb_row": 5, "nb_filter": 48, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "border_mode": "same", "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "nb_row": 3, "nb_filter": 64, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "same", "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_4", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "nb_row": 3, "nb_filter": 64, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "same", "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_5", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true, "name": "dense_1", "output_dim": 1164, "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 11840, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true, "name": "dense_2", "output_dim": 100, "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 1164, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true, "name": "dense_3", "output_dim": 50, "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 100, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true, "name": "dense_4", "output_dim": 10, "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 50, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true, "name": "dense_5", "output_dim": 1, "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 10, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}